[{"price": "€550,000", "number_of_bedrooms": 3, "square_footage": 2100, "description": "Modern, spacious villa with panoramic views of the city. The house features a beautifully manicured garden, a fully equipped kitchen, and a large garage.", "neighborhood_description": "Situated in the most gentrified neighborhood in Porto, known for its peaceful ambience, high-end shops, and close proximity to the city center."}, {"price": "€375,000", "number_of_bedrooms": 2, "square_footage": 1400, "description": "Charming townhouse in a historic building, with modern amenities and original architectural details. Comes with a lovely terrace and fireplace.", "neighborhood_description": "Located in a tranquil neighborhood, full of local cafes and shops, and walking distance from the Douro River."}, {"price": "€650,000", "number_of_bedrooms": 4, "square_footage": 2400, "description": "Luxurious detached house with high-end finishes, a spacious private yard, a swimming pool, and a rooftop terrace.", "neighborhood_description": "Neighborly ambience, with high-rated schools and parks, 15 min away from the city center."}, {"price": "€275,000", "number_of_bedrooms": 1, "square_footage": 800, "description": "Cozy apartment in a modern building, with open-plan living and a fully fitted kitchen. Large windows and a balcony offer stunning city views.", "neighborhood_description": "Situated in Porto's bustling downtown, with great connection to public transport, restaurants, and entertainment venues."}, {"price": "€800,000", "number_of_bedrooms": 5, "square_footage": 3200, "description": "A lavish villa with lots of natural light, spacious living areas, and contemporary architecture. Includes a large garden and a private swimming pool.", "neighborhood_description": "Set in a desirable area, known for its long stretches of green spaces, upscale dining options, and posh boutiques."}, {"price": "€400,000", "number_of_bedrooms": 3, "square_footage": 1800, "description": "A modern duplex with a large living room, fully equipped kitchen, and a private terrace. The house is furnished with minimalist, contemporary pieces.", "neighborhood_description": "A vibrant and artistically-plentiful neighborhood, filled with galleries, live music venues, and creative businesses."}, {"price": "€300,000", "number_of_bedrooms": 2, "square_footage": 1600, "description": "Charming and well-maintained apartment with a private garden, a spacious kitchen, and hardwood floors.", "neighborhood_description": "Located in a family-friendly neighborhood offering many recreational parks, trendy cafes, and grocery stores."}, {"price": "€480,000", "number_of_bedrooms": 2, "square_footage": 1400, "description": "Stylish, renovated loft with high ceilings, large windows and exposed brick. Features bright and open spaces, as well as a private balcony.", "neighborhood_description": "Set in a quiet and safe area, with easy access to public transportation, and plentiful shopping options."}, {"price": "€900,000", "number_of_bedrooms": 4, "square_footage": 2800, "description": "Stunning Riverside apartment with a modern kitchen, luxurious master suite, and expansive balcony offering panoramic views of the Douro River.", "neighborhood_description": "Set in one of Porto's most historic and picturesque neighborhoods, famous for its waterfront promenade, quaint shops, and trendy wine bars."}, {"price": "€350,000", "number_of_bedrooms": 2, "square_footage": 1200, "description": "Beautifully maintained traditional townhouse with many original features in a peaceful setting. Includes a large outdoor terrace and basement storage.", "neighborhood_description": "Situated in a charming neighborhood with lush parks, great schools, local eateries, and close to the centre."}]